In [10]:
import pandas as pd
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score
from sklearn.model_selection import train_test_split

In [32]:
data_set=pd.read_csv("Income2.csv")
data_set.head()

   Unnamed: 0  Education   Seniority     Income
0           1  21.586207  113.103448  99.917173
1           2  18.275862  119.310345  92.579135
2           3  12.068966  100.689655  34.678727
3           4  17.034483  187.586207  78.702806
4           5  19.931034   20.000000  68.009922

In [33]:
data_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
Unnamed: 0    30 non-null int64
Education     30 non-null float64
Seniority     30 non-null float64
Income        30 non-null float64
dtypes: float64(3), int64(1)
memory usage: 1.1 KB

In [34]:
data_set.keys()

Index(['Unnamed: 0', 'Education', 'Seniority', 'Income'], dtype='object')

In [35]:
data_set.describe()

       Unnamed: 0  Education   Seniority     Income
count   30.000000  30.000000   30.000000  30.000000
mean    15.500000  16.386207   93.862069  62.744733
std      8.803408   3.810622   55.715623  27.013285
min      1.000000  10.000000   20.000000  17.613593
25%      8.250000  12.482759   44.827586  36.392043
50%     15.500000  17.034483   94.482759  70.804791
75%     22.750000  19.931034  133.275862  85.930608
max     30.000000  21.586207  187.586207  99.917173

In [36]:
data_set.shape

(30, 4)

In [37]:
x=data_set.iloc[:,1:3]
y=data_set.iloc[:,-1]

In [38]:
x.head()

   Education   Seniority
0  21.586207  113.103448
1  18.275862  119.310345
2  12.068966  100.689655
3  17.034483  187.586207
4  19.931034   20.000000

In [39]:
y.head()

0    99.917173
1    92.579135
2    34.678727
3    78.702806
4    68.009922
Name: Income, dtype: float64

In [67]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.25)

In [68]:
lin_reg=LinearRegression()

In [69]:
lin_reg.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [70]:
# predictions
y_pred=lin_reg.predict(x_test)
y_pred

array([24.91991401, 83.05247815, 76.71520508, 39.9688725 , 63.35290232,
       18.23876263, 83.42909224, 91.07640697])

In [71]:
y_pred[0]

24.919914005124504

In [72]:
y_test

25    21.388561
11    96.282997
1     92.579135
10    31.913808
13    66.601792
23    18.570665
8     90.006327
6     87.970467
Name: Income, dtype: float64

In [73]:
# r2 score and accuracy

In [74]:
r2_score(y_test,y_pred)

0.9292234201752833

In [75]:
lin_reg.score(x_test,y_test)

0.9292234201752833